tutorials/isothermalFilm/rivuletPanel/0/delta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            turbulentInlet;
        // type            fixedValue;
        fluctuationScale 0.05;
        referenceField  uniform 1e-3;
        alpha           0.1;
        value           uniform 1e-3;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    wall
    {
        type            filmContactAngle;

        contactAngle
        {
            type            gravitational;
            theta0          70;
            thetaAdv        90;
            thetaRec        50;
            gTheta          0.1;
        }

        value           $internalField;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
